examples/aldFoam/system/controlDict
// This file is part of aldFoam
// Copyright 2019 Argonne UChicago LLC

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     aldFoam;

libs            ("libfirstorder.so" "libdose.so" "libsampling.so");

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1.0;

deltaT          0.0001;

writeControl    timeStep;

writeInterval   200;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    #includeFunc singleGraph
    #includeFunc probes
	cuttingPlane
	{
	    type            surfaces;

	    writeControl    writeTime;

	    surfaceFormat   vtk;

	    fields          ( N1 U );

	    interpolationScheme cellPoint;

	    surfaces
	    (
		zNormal
		{
		    type            cuttingPlane;
		    planeType       pointAndNormal;
		    point           (0.20 0.01 0.001);
		    normal          (0 0 1);
		    interpolate     true;
		}
	    );
	}
}

// ************************************************************************* //
