examples/aldFoam/0/N1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      N1;
}

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            uniformFixedValue;
        uniformValue    table (
                            (0 0)
                            (0.05 1)
                            (0.1 1)
                            (0.15 0));

    }

    Wall
    {
        type            firstorder;
        betaField       beta;
        diffCoeff       D1;
        vth             vth;
        value           uniform 0.0;
    }

    substrate
    {
        type            firstorder;
        betaField       beta;
        diffCoeff       D1;
        vth             vth;
        value           uniform 0.0;
    }

    outlet
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
